# Taps
tap 'caskroom/cask'
tap 'caskroom/fonts'
tap 'caskroom/versions'
tap 'homebrew/bundle'
tap 'homebrew/dupes'
tap 'homebrew/php'
tap 'bramstein/webfonttools'

# Make sure apps get installed in system Applications dir
cask_args appdir: '/Applications'

# Install GNU core utilities (those that come with OS X are outdated)
brew 'coreutils'

# Install other useful utilities
brew 'moreutils'

# Install GNU `find`, `locate`, `updatedb`, and `xargs`, g-prefixed
brew 'findutils'

# Install GNU `sed`, overwriting the built-in `sed`.
brew 'gnu-sed', args: ['with-default-names']

# Install Bash 4
brew 'bash'

# Install Completion
brew 'bash-completion2'

# Install more recent versions of some OS X tools
brew 'vim', args: ['override-system-vi']
brew 'homebrew/dupes/grep'
brew 'homebrew/dupes/openssh'
brew 'homebrew/dupes/screen'

# Install Font Tools
brew 'sfnt2woff'
brew 'sfnt2woff-zopfli'
brew 'woff2'

# Install some CTF tools; see https://github.com/ctfs/write-ups.
brew 'aircrack-ng'
brew 'bfg'
brew 'binutils'
brew 'binwalk'
brew 'cifer'
brew 'dex2jar'
brew 'dns2tcp'
brew 'fcrackzip'
brew 'foremost'
brew 'hashpump'
brew 'hydra'
brew 'john'
brew 'knock'
brew 'netpbm'
brew 'nmap'
brew 'pngcheck'
brew 'socat'
brew 'sqlmap'
brew 'tcpflow'
brew 'tcpreplay'
brew 'tcptrace'
brew 'ucspi-tcp'
brew 'xpdf'
brew 'xz'

# Install Binaries
brew 'ack'
brew 'dark-mode'
brew 'awscli'
brew 'git'
brew 'git-lfs'
brew 'imagemagick', args: ['with-webp']
brew 'lua'
brew 'lynx'
brew 'p7zip'
brew 'pigz'
brew 'pv'
brew 'rename'
brew 'speedtest_cli'
brew 'ssh-copy-id'
brew 'testssl'
brew 'vbindiff'
brew 'webkit2png'
brew 'zopfli'
brew 'hub'
brew 'tree'
brew 'mackup'
brew 'node'
brew 'trash'
brew 'wget', args: ['with-iri']

# Development
brew 'php56', args: ['with-gmp', 'with-debug', 'without-apache']

# Apps
cask 'aerial'
cask 'adobe-creative-cloud'
cask 'tweetbot'
cask 'alfred'
cask 'atom'
cask 'dash'
cask 'dropbox'
cask 'firefox'
cask 'google-chrome'
cask 'vivaldi'
cask 'webstorm'
cask 'screenhero'
cask 'sequel-pro'
cask 'skype'
cask 'slack'
cask 'sublime-text3'
cask 'textual'
cask 'kaleidoscope'
cask 'robomongo'
cask 'daisydisk'
cask 'toggldesktop'
cask 'bartender'
cask 'tower'
cask 'transmit'
cask 'transmission'
cask 'handbrake'
cask 'little-snitch'
cask 'imagealpha'
cask 'imageoptim'
cask 'tunnelblick'
cask 'dnscrypt'
cask 'fontprep'
cask 'microsoft-office'
cask 'cyberduck'
cask 'vlc'

# Quicklook
cask 'qlcolorcode'
cask 'qlmarkdown'
cask 'quicklook-json'
cask 'quicklook-csv'
cask 'qlstephen'

# Fonts
cask 'font-sauce-code-powerline'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'
